<h3>Добро пожаловать в систему <?php echo Yii::app()->name ?>!</h3>
<p class="text-left">
    Здесь вы найдёте инструменты, облегчающие повседневную работу врача. Для того, чтобы перейти к определённому инструменту, выберите пункт из меню, находящегося слева.
</p>
<!--<p class="text-left">
    Изменения, происходящие в системе, можно отследить по нижней ссылке в меню ("Лог изменений").
</p>
<p class="text-left ">
    <strong><h4 class="text-danger">Для текста поиска пациента пользуйтесь пока поиском по номеру медкарты, адресу или серии-номеру документа! База пока не оптимизирована под поиск по 8 млн. ОМС, что не позволяет искать приемлемое время по ФИО или номеру полиса.</h4></strong>
</p>-->