<h4>Краткая справка</h4>
<p>Раздел предназначен для редактирования содержания медицинской карты для рабочего места врача. Карта у врача разбита на категории (раскрывающиеся списки), внутри них имеются управляющие элементы, которые могут представлять собой в том числе выбор значения из справочника.
    При формировании шаблона карты требуется определить группы, поля карты, справочники и привязать последние к определённым полям. Справочники при необходимости можно дополнять значениями.
</p>
<?php $this->widget('application.components.widgets.DoctorCardTabMenu') ?>
